Documents/абс_УпаковочныйЛист/абс_УпаковочныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_УпаковочныйЛист</name>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Упаковки</name>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеИспользования</name>
    <type>
      <types>CatalogRef.НазначенияИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>CatalogRef.НаправленияСписанияВыпущеннойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>CatalogRef.ПорядокПрисвоенияСерийныхНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКП</name>
    <comment>Общероссийский классификатор продукции</comment>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусНоменклатуры</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РотацияНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеИспользоватьПриПодборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТУ</name>
    <type>
      <types>CatalogRef.Лео_ТехническиеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТипУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ОрганолептическиеПоказатели</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказателиБезопасности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ФормаВыпуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ВнешнийВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ИмяСпец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОперативныйСтатусНоменклатуры</name>
    <type>
      <types>CatalogRef.Лео_ОперативныйСтатусНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДопДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_белки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_жиры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_углеводы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_КК</name>
    <comment>Энергетическая ценность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Аллерген</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АдресХранения</name>
    <type>
      <types>CatalogRef.Лео_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_РодительНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НоменклатураДляЗамены</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Замес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_АртикулыПокупателя</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПокупателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Documents/абс_УпаковочныйЛист/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	ЗаполнитьТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Объект.Товары.Загрузить(Объект.ДокументОснование.Товары.Выгрузить());
	КонецЕСли;	
	Элементы.Товары.Обновить();
	Модифицированность = Истина;
	
	Если Объект.Упаковки.Количество() = 1 Тогда
		Для Каждого Строка Из Объект.Товары Цикл	
			Строка.НомерУпаковки = Объект.Упаковки[0].НомерУпаковки;
			Строка.Упаковка      = Объект.Упаковки[0].Упаковка;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьУпаковочногоЛиста(Команда)
	ТабУпаковочныйЛист = ПечатьУпаковочногоЛистаНаСервере();
	//ТабУпаковочныйЛист.Показать();
	УниверсальныеМеханизмы.НапечататьДокумент(ТабУпаковочныйЛист, 1, Ложь, ОбщегоНазначения.СформироватьЗаголовокДокумента(Объект.Ссылка), Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ПечатьУпаковочногоЛистаНаСервере()
	Возврат Документы.абс_УпаковочныйЛист.ПечатьУпаковочногоЛиста(Объект.Ссылка);
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//абс Урал 06.02.2014: По умолчанию создается одна упаковка
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НоваяСтрока = Объект.Упаковки.Добавить();
		НоваяСтрока.Упаковка = "Упаковка 1";
		НоваяСтрока.НомерУпаковки = "1"; 
		
		//привязка номенклатуры к упаковке по умолчанию
		Для Каждого Строка Из Объект.Товары Цикл	
			Строка.НомерУпаковки = НоваяСтрока.НомерУпаковки;
			Строка.Упаковка      = НоваяСтрока.Упаковка;
		КонецЦикла;
			
	КонецЕсли;
	//\\абс Урал 06.02.2014
	
КонецПроцедуры

&НаКлиенте
Процедура РазбитьСтроку(Команда)
	
	Перем РазрядностьОкругления;
	РазрядностьОкругления = 0; 
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если НЕ ТекущаяСтрока.КоличествоМест Тогда
			Сообщить("Разбивка идет по количеству мест. Оно не может быть пустым.");
			Возврат;
		КонецЕсли;
		
		ОбщееЧисло = ТекущаяСтрока.КоличествоМест;
		ВвестиЧисло(ОбщееЧисло, "Введите количество мест", 10, 0);
		
		Если ОбщееЧисло < 0 Тогда
			ОбщееЧисло = - ОбщееЧисло;
		КонецЕсли;
		
		Если ОбщееЧисло = 0 Или ОбщееЧисло = ТекущаяСтрока.КоличествоМест Тогда
			Возврат;
		ИначеЕсли ОбщееЧисло > ТекущаяСтрока.КоличествоМест Тогда
			Сообщить("Не может количество мест быть больше изначального количества");
			Возврат;
		КонецЕсли;
		
		НоваяСтрока = Объект.Товары.Вставить(ТекущаяСтрока.НомерСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.КоличествоМест = ОбщееЧисло;
        НоваяСтрока.Количество = Окр(НоваяСтрока.КоличествоМест / ТекущаяСтрока.КоличествоМест * ТекущаяСтрока.Количество, РазрядностьОкругления);
			
		ТекущаяСтрока.КоличествоМест = ТекущаяСтрока.КоличествоМест - ОбщееЧисло;
		ТекущаяСтрока.Количество     = ТекущаяСтрока.Количество - НоваяСтрока.Количество;	
		Модифицированность = Истина;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСписокУпаковок()
	
	СписокУпаковок = Новый СписокЗначений;
	Для Каждого Строка Из Объект.Упаковки Цикл
		НовыйЭлемент = СписокУпаковок.Добавить();
		НовыйЭлемент.Значение      = Строка.НомерСтроки - 1;
		НовыйЭлемент.Представление = "" + Строка.Упаковка;
	КонецЦикла;	
	Возврат СписокУпаковок;
	
КонецФункции

&НаКлиенте
Процедура УпаковкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		
		//установка очередного номера упаковки
		Для Каждого Строка Из Объект.Упаковки Цикл
			Если Элемент.ТекущиеДанные.НомерУпаковки < Строка.НомерУпаковки Тогда
				Элемент.ТекущиеДанные.НомерУпаковки = Строка.НомерУпаковки;
			КонецЕсли;
		КонецЦикла;
		Элемент.ТекущиеДанные.НомерУпаковки = Элемент.ТекущиеДанные.НомерУпаковки + 1;
		
	КонецЕсли;
	
КонецПроцедуры
 

&НаКлиенте
Процедура ТоварыУпаковкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокУпаковок = ПолучитьСписокУпаковок();
	ВыбранныйЭлемент = ВыбратьИзСписка(СписокУпаковок, Элемент, );
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Индекс = ВыбранныйЭлемент.Значение;
		СтрокаУпаковки = Объект.Упаковки[Индекс];

		ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
		ТекущаяСтрока.НомерУпаковки = СтрокаУпаковки.НомерУпаковки;
		ТекущаяСтрока.Упаковка      = СтрокаУпаковки.Упаковка;
		Модифицированность = Истина;
		
	КонецЕсли;
	СтандартнаяОбработка = Ложь;

	
КонецПроцедуры


&НаКлиенте
Процедура ДокументОснованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ Объект.Товары.Количество() Или Вопрос("Табличная часть Товары будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиПередУдалением(Элемент, Отказ)
	
	Строки = Объект.Товары.НайтиСтроки(Новый Структура("НомерУпаковки", Элементы.Упаковки.ТекущиеДанные.НомерУпаковки));	
	Для Каждого Строка Из Строки Цикл
		Строка.НомерУпаковки = 0;
		Строка.Упаковка      = "";
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТовары(Команда)
	
	Если НЕ Объект.Товары.Количество() Или Вопрос("Табличная часть Товары будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Объект.Товары.Очистить();
		Объект.Упаковки.Очистить();

	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	ТЗ = ЗагрузкаExcel();
	ЗагрузитьТоварыНаСервере(ТЗ);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТоварыНаСервере(ТЗ)

		
	Для Каждого Строка из ТЗ Цикл	
		НомерУпаковки = Число(СокрЛП(Строка[7]));
		

        МассивСтрок = Объект.Упаковки.НайтиСтроки(Новый Структура("НомерУпаковки",НомерУпаковки) );   

		
		//СтрокаУпаковки = Объект.Упаковки.Найти(НомерУпаковки, "НомерУпаковки");
		Если МассивСтрок.Количество() = 0 Тогда
			 СтрокаУпаковки = Объект.Упаковки.Добавить();
			 СтрокаУпаковки.НомерУпаковки = НомерУпаковки; 
			 СтрокаУпаковки.Упаковка = "Упаковка " + Строка(НомерУпаковки);
		КонецЕсли;	 
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Строка[1]);
		НоваяСтрока.ЕдиницаИзмеренияМест = НоваяСтрока.Номенклатура.ЕдиницаИзмеренияМест;
		НоваяСтрока.ЕдиницаИзмерения = НоваяСтрока.Номенклатура.ЕдиницаХраненияОстатков;
		НоваяСтрока.Количество  = Строка[5];
		НоваяСтрока.НомерУпаковки = НомерУпаковки;
		НоваяСтрока.Упаковка = СтрокаУпаковки.Упаковка;
		НоваяСтрока.СерияНоменклатуры = Справочники.СерииНоменклатуры.НайтиПоНаименованию(СокрЛП(Строка[3]), Истина, , НоваяСтрока.Номенклатура);
		РассчитатьКоличествоМест(НоваяСтрока);
	КонецЦикла;
	
	
	//Строка = ТабличнаяЧастьДокумента.Найти(Сч, "НомерСтроки");
	
	
	Элементы.Товары.Обновить();
	Элементы.Упаковки.Обновить();
	Модифицированность = Истина;
	//
КонецПроцедуры


&НаСервере
Процедура РассчитатьКоличествоМест(ТекущаяСтрока)
	Если Не ТекущаяСтрока = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмерения) И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " не выбрана единица измерения цены!
				                 |Пересчет количества невозможен.");
		
		ИначеЕсли НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЕдиницаИзмеренияМест) Тогда
			ТекущаяСтрока.КоличествоМест = 0;
		Иначе
			Если ТекущаяСтрока.ЕдиницаИзмерения.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
					ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения цены "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмерения) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			ИначеЕсли ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент = 0 И ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Для " + СокрЛП(ТекущаяСтрока.Номенклатура) + " у единицы измерения мест "
					                 + СокрЛП(ТекущаяСтрока.ЕдиницаИзмеренияМест) + " не проставлен коэффициент!
					                 |Пересчет количества невозможен.");
			Иначе
				//Расчет количества в единицах измерения мест - КоличествоМест				 
                ЕдиницаИзмеренияМест = ТекущаяСтрока.ЕдиницаИзмеренияМест;
				Если ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмеренияМест Тогда
					КоличествоМест = ТекущаяСтрока.Количество;
				Иначе
					КоличествоМест = ТекущаяСтрока.Количество * ТекущаяСтрока.ЕдиницаИзмерения.Коэффициент / ТекущаяСтрока.ЕдиницаИзмеренияМест.Коэффициент;
				КонецЕсли;
				
				//Если Цел(КоличествоМест)<>КоличествоМест Тогда	
				//	СтрокаТабличнойЧасти.КоличествоМест = КоличествоМест;
				//КонецЕсли;
				ТекущаяСтрока.КоличествоМест = КоличествоМест;
			КонецЕсли;
		КонецЕсли;
	//ПересчитатьСумму ();	
	КонецЕсли;	
КонецПроцедуры

   
&НаКлиенте
Функция ЗагрузкаExcel() Экспорт
	ТаблицаЗначенийExcel = Новый ТаблицаЗначений;	
	НомерСтраницы = 1;
	Фильтр = "Лист Excel (*.xls;*.xlsx)|*.xls;*.xlsx";
	ИмяФайла = ВыбратьФайл(Фильтр, "Выберите XLS файл");
	Если ИмяФайла = Ложь Тогда
		//Сообщить("Не выбран файл!");		
		Возврат ТаблицаЗначенийExcel;
	КонецЕсли;	
	
	Попытка
		ОбъектXLSФайл = Новый COMОбъект("Excel.Application");
		XLSОбъект = ОбъектXLSФайл.WorkBooks.Open(ИмяФайла);
		ЛистXLS = XLSОбъект.Sheets(НомерСтраницы);
	Исключение		
		сообщить("Невозможно загрузить MS EXCEL !" + Символы.ПС + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Состояние("Считывание информации о файле...");
	
	МассивXLS 	= ЛистXLS.UsedRange.Value; //только заполненная область
	Массив 		= МассивXLS.Выгрузить();    
	МассивXLS   = 0 ;
	КоличествоКолонок = Массив.ВГраница();
	КоличествоСтрок   = Массив.Получить(0).Количество();

	ТаблицаЗначенийExcel.Колонки.Добавить("НомерСтроки",ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(8),"НомерСтроки","10");
	
	Для НомерКолонки = 0 По КоличествоКолонок Цикл
		ИмяКолонки = ОбработатьИмяКолонки(Массив[НомерКолонки][0]);	
		ИмяКолонкиДобавлена = ИмяКолонки;
		Попытка
			Если ТаблицаЗначенийExcel.Колонки.Найти(ИмяКолонки) = Неопределено Тогда
				ТаблицаЗначенийExcel.Колонки.Добавить(ИмяКолонки,ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(255),Массив[НомерКолонки][0],"20");
			Иначе
				А = 0;
				Для А = 0 По 999999999999 Цикл
					ИмяКолонки1 = ИмяКолонки + "_" + СокрЛП(А);
					ИмяКолонкиДобавлена = ИмяКолонки1;
					Если ТаблицаЗначенийExcel.Колонки.Найти(ИмяКолонки1) = Неопределено Тогда
						ТаблицаЗначенийExcel.Колонки.Добавить(ИмяКолонки1,ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(255),Массив[НомерКолонки][0],"20");
						Прервать;						
					КонецЕсли;					
				КонецЦикла;	
			КонецЕсли;	
		Исключение
			Сообщить("Ошибка в имени колонки: " + ИмяКолонкиДобавлена);
			Возврат Ложь;
		КонецПопытки;    		
	КонецЦикла;
	
		Для НомерСтроки = 1 по КоличествоСтрок - 1 Цикл
			//ОбработкаПрерыванияПользователяОтладка();
			НоваяСтрока = ТаблицаЗначенийExcel.Добавить();
			НоваяСтрока.НомерСтроки = НомерСтроки;
			Для НомерКолонки = 0 по КоличествоКолонок Цикл
				НоваяСтрока.Установить(НомерКолонки + 1,Массив[НомерКолонки][НомерСтроки]);
			КонецЦикла;
			Состояние("Загрузка данных из Excel. Обрабатывается строка номер " + СокрЛП(НомерСтроки));
		КонецЦикла;
	//КонецЕсли;
	
	ОбъектXLSФайл.Workbooks(1).Close(0); 
	ОбъектXLSФайл.Quit();

	Возврат ТаблицаЗначенийExcel;
КонецФункции	

&НаКлиенте
Функция ВыбратьФайл(Фильтр = "", Заголовок = "", Каталог = "",  МножественныйВыбор = Ложь, ПредварительныйПросмотр = ложь, ПроверятьСуществованиеФайла = Ложь) Экспорт 
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);	
	ДиалогВыбора.Фильтр = Фильтр;
	ДиалогВыбора.Каталог = Каталог;
	ДиалогВыбора.Заголовок = Заголовок;
	ДиалогВыбора.МножественныйВыбор = МножественныйВыбор;
	ДиалогВыбора.ПредварительныйПросмотр = ПредварительныйПросмотр;
	ДиалогВыбора.ПроверятьСуществованиеФайла = ПроверятьСуществованиеФайла;
	
	Если ДиалогВыбора.Выбрать() Тогда
		Если МножественныйВыбор Тогда
			Возврат ДиалогВыбора.ВыбранныеФайлы;
		Иначе
			Возврат ДиалогВыбора.ПолноеИмяФайла;
		КонецЕсли; 
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции	

&НаКлиенте
Функция ОбработатьИмяКолонки(ИмяКолонки) Экспорт 
	Результат = ИмяКолонки;
	Результат = СтрЗаменить(Результат," ","");
	Результат = СтрЗаменить(Результат,"-","");
	Результат = СтрЗаменить(Результат,"(","");
	Результат = СтрЗаменить(Результат,")","");
	Результат = СтрЗаменить(Результат,",","");
	Результат = СтрЗаменить(Результат,"$","");	
	Результат = СтрЗаменить(Результат,"#","");
	Результат = СтрЗаменить(Результат,"/",""); 	
	Результат = СтрЗаменить(Результат,"№",""); 	
	Результат = СтрЗаменить(Результат,"+","");
	Результат = СтрЗаменить(Результат,"%",""); 	
	Результат = СтрЗаменить(Результат,".",""); 	
	Результат = СтрЗаменить(Результат,":",""); 	
	Результат = СтрЗаменить(Результат,";",""); 	
	Результат = СтрЗаменить(Результат,">",""); 	
	Результат = СтрЗаменить(Результат,"<",""); 	
	Результат = СтрЗаменить(Результат,"!",""); 		
	Результат = СтрЗаменить(Результат,"?",""); 		
	Результат = СтрЗаменить(Результат,"*",""); 		
	Результат = СтрЗаменить(Результат,"@",""); 		
	Результат = СтрЗаменить(Результат,"^","");
	Результат = СтрЗаменить(Результат,"`","");
	Результат = СтрЗаменить(Результат,"~","");
	Результат = СтрЗаменить(Результат,"=","");
	Результат = СтрЗаменить(Результат,"'","");
	Результат = СтрЗаменить(Результат,Символы.ВК,  "");
	Результат = СтрЗаменить(Результат,Символы.ВТаб,"");	
	Результат = СтрЗаменить(Результат,Символы.НПП, "");	
	Результат = СтрЗаменить(Результат,Символы.ПС,  "");
	Результат = СтрЗаменить(Результат,Символы.ПФ,  "");
	Результат = СтрЗаменить(Результат,Символы.Таб, "");
	Результат = СтрЗаменить(Результат,Символ(7),   ""); 
	Результат = СтрЗаменить(Результат,"¶",         ""); 

	Результат = ?(СокрЛП(Результат) = "","_",СокрЛП(Результат));
	Возврат Результат;
КонецФункции
